app/controllers/reviews_controller.rb

	def index
  		@review = Review.new
  		@isbn = params[:isbn]
  		puts @isbn
  		@reviews = Review.where(
  		"cast(isbn as text) LIKE :query OR review_text LIKE :query OR title LIKE :query",
  		query: "%#{params[:isbn]}%")
---
SELECT "reviews".* FROM "reviews" WHERE (isbn LIKE '%god%' OR review_text LIKE '%god%' OR title LIKE '%god%')

    def show
  	@review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", nil]]

  	def create
  			@review = Review.new
			@isbn = params[:choice]
			puts @isbn
			# @clean_isbn = @isbn.delete("-").delete(" ")
			puts @clean_isbn
			if @clean_isbn.length==10 || @clean_isbn.length==13 && @clean_isbn.numeric?
				puts "That's a nice, clean isbn."
				api_reviews = ReviewApi::CalledReviews.new
				@reviews_array = api_reviews.call_reviews(@clean_isbn)
				@reviews_array.each_with_index do |this|
						isbn = this[:isbn]
						title = this[:title]
						review_text = this[:review_text]
						likes = this[:likes]
						shelves = this[:shelves]
					@added_review = Review.create(isbn: isbn,
  						title: title,
  						review_text: review_text,
  						likes: likes,
  						shelves: shelves,
						star_rating: rand(0..5))
---
INSERT INTO "reviews" ("isbn", "title", "review_text", "likes", "shelves", "star_rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  	def star_rating_filter
  		#get star filtered reviews text
	  	@user_cloud_prefs = [stars: params[:stars], count: params[:count], user_excludes: params[:user_excludes]]
  		#pass to wordcounter
		new_count = WordCloud::WordCount.new(@user_cloud_prefs)
		@top_terms = new_count.get_reviews_by_stars
		@arr = []
		@top_terms.each do |k,v|
---
SELECT "reviews".* FROM "reviews" WHERE (isbn LIKE '1' OR review_text LIKE '1' OR title LIKE '1')